Repository: nikmedoed/windows_backup_tool
Catalog: locales/*/LC_MESSAGES/app.po
Languages: ru

source: Windows Backup Tool
ru: Инструмент резервного копирования Windows

source: Run backup according to the saved configuration (called from the scheduler)
ru: Запуск копирования по сохранённой конфигурации (вызывается планировщиком)

source: Run in development mode (if elevating, show console window)
ru: Запуск в режиме разработки (при повышении прав показывать консоль)

source: No saved configuration, run GUI first.
ru: Конфигурация не найдена, запустите графический интерфейс.

source: Scanned: {scanned} | Copied: {copied} | Unchanged: {unchanged} | Errors: {errors}
ru: Просканировано: {scanned} | Скопировано: {copied} | Без изменений: {unchanged} | Ошибок: {errors}

source: Progress
ru: Ход выполнения

source: 🔍 Starting backup…
ru: 🔍 Начинается копирование…

source: ❌ Target path "{0}" exists but is not a directory
ru: ❌ Путь "{0}" существует, но это не папка

source: 📁 Created target directory {0}
ru: 📁 Создана папка назначения {0}

source: ❌ Could not create target directory "{0}": {1}
ru: ❌ Не удалось создать папку "{0}": {1}

source: 📂 Scanning files…
ru: 📂 Сканирование файлов…

source: ⚠️ Backup finished with errors. Press Enter to exit…
ru: ⚠️ Копирование завершено с ошибками. Нажмите Enter для выхода…

source: ✅ Backup completed successfully. Window will close in 10 seconds…
ru: ✅ Копирование успешно завершено. Окно закроется через 10 секунд…

source: 🛠 Analyzing files on changes…
ru: 🛠 Анализ изменений…

source: Analyzing…
ru: Анализ…

source: ✅ No changes detected. Backup not required.
ru: ✅ Изменений нет. Копирование не требуется.

source: ▶ {tasks} files to copy, {unchanged} unchanged
ru: ▶ Копировать: {tasks} файлов, без изменений: {unchanged}

source: Copying…
ru: Копирование…

source: ❗ Error copying {src} → {dst} ({exc})
ru: ❗ Ошибка копирования {src} → {dst} ({exc})

source: ⚠️ Errors logged in: {0}
ru: ⚠️ Ошибки записаны в: {0}

source: Exclusions
ru: Исключения

source: Expand All
ru: Развернуть всё

source: Collapse All
ru: Свернуть всё

source: Expand Current
ru: Развернуть выбранное

source: Collapse Current
ru: Свернуть выбранное

source: Select All
ru: Выбрать всё

source: Deselect All
ru: Снять выделение

source: Full Height
ru: Полная высота

source: Save
ru: Сохранить

source: File / Folder
ru: Файл / Папка

source: Size
ru: Размер

source: Selected: {count} • Size: {size}
ru: Выбрано: {count} • Размер: {size}

source: Backup Tool Settings
ru: Настройки копирования

source: Backup target:
ru: Папка назначения:

source: Sources:
ru: Источники:

source: + Add source
ru: + Добавить источник

source: – Delete
ru: – Удалить

source: Clear
ru: Очистить

source: Exclusions for source:
ru: Исключения для источника:

source: Schedule
ru: Расписание

source: Daily at 03:00
ru: Каждый день в 03:00

source: Weekly (Mon at 03:00)
ru: Каждую неделю (Пн в 03:00)

source: On logon
ru: При входе в систему

source: On idle (20 min)
ru: В простое (20 мин)

source: On unlock
ru: При разблокировке

source: Restore
ru: Восстановить

source: Run backup
ru: Сделать копию

source: Exit
ru: Выход

source: Select target directory
ru: Выберите папку назначения

source: Add source directory
ru: Добавить папку источника

source: Exclusions for: {source}
ru: Исключения для: {source}

source: Error
ru: Ошибка

source: Please specify the target directory
ru: Укажите папку назначения

source: Saved
ru: Сохранено

source: No settings found
ru: Настройки не найдены

source: Restored
ru: Восстановлено

source: Calculating size…
ru: Подсчёт размера…

source: Estimated backup size: {size}
ru: Оценочный размер копии: {size}

source: Backing up…
ru: Копирование…

source: Done
ru: Готово
